ataradov/mcu-starter-projects/samg53/include/component/tc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_IDR_OFFSET                       (0x28)                                        /**<  (TC_IDR) Interrupt Disable Register (channel = 0)  Offset */

#define TC_IDR_COVFS_Pos                    0                                              /**< (TC_IDR) Counter Overflow Position */
#define TC_IDR_COVFS_Msk                    (_U_(0x1) << TC_IDR_COVFS_Pos)                 /**< (TC_IDR) Counter Overflow Mask */
#define TC_IDR_COVFS                        TC_IDR_COVFS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_COVFS_Msk instead */
#define TC_IDR_LOVRS_Pos                    1                                              /**< (TC_IDR) Load Overrun Position */
#define TC_IDR_LOVRS_Msk                    (_U_(0x1) << TC_IDR_LOVRS_Pos)                 /**< (TC_IDR) Load Overrun Mask */
#define TC_IDR_LOVRS                        TC_IDR_LOVRS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_LOVRS_Msk instead */
#define TC_IDR_CPAS_Pos                     2                                              /**< (TC_IDR) RA Compare Position */
#define TC_IDR_CPAS_Msk                     (_U_(0x1) << TC_IDR_CPAS_Pos)                  /**< (TC_IDR) RA Compare Mask */
#define TC_IDR_CPAS                         TC_IDR_CPAS_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_CPAS_Msk instead */
#define TC_IDR_CPBS_Pos                     3                                              /**< (TC_IDR) RB Compare Position */
#define TC_IDR_CPBS_Msk                     (_U_(0x1) << TC_IDR_CPBS_Pos)                  /**< (TC_IDR) RB Compare Mask */
#define TC_IDR_CPBS                         TC_IDR_CPBS_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_CPBS_Msk instead */
#define TC_IDR_CPCS_Pos                     4                                              /**< (TC_IDR) RC Compare Position */
#define TC_IDR_CPCS_Msk                     (_U_(0x1) << TC_IDR_CPCS_Pos)                  /**< (TC_IDR) RC Compare Mask */
#define TC_IDR_CPCS                         TC_IDR_CPCS_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_CPCS_Msk instead */
#define TC_IDR_LDRAS_Pos                    5                                              /**< (TC_IDR) RA Loading Position */
#define TC_IDR_LDRAS_Msk                    (_U_(0x1) << TC_IDR_LDRAS_Pos)                 /**< (TC_IDR) RA Loading Mask */
#define TC_IDR_LDRAS                        TC_IDR_LDRAS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_LDRAS_Msk instead */
#define TC_IDR_LDRBS_Pos                    6                                              /**< (TC_IDR) RB Loading Position */
#define TC_IDR_LDRBS_Msk                    (_U_(0x1) << TC_IDR_LDRBS_Pos)                 /**< (TC_IDR) RB Loading Mask */
#define TC_IDR_LDRBS                        TC_IDR_LDRBS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_LDRBS_Msk instead */
#define TC_IDR_ETRGS_Pos                    7                                              /**< (TC_IDR) External Trigger Position */
#define TC_IDR_ETRGS_Msk                    (_U_(0x1) << TC_IDR_ETRGS_Pos)                 /**< (TC_IDR) External Trigger Mask */
#define TC_IDR_ETRGS                        TC_IDR_ETRGS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_ETRGS_Msk instead */
#define TC_IDR_ENDRX_Pos                    8                                              /**< (TC_IDR) End of Receiver Transfer Position */
#define TC_IDR_ENDRX_Msk                    (_U_(0x1) << TC_IDR_ENDRX_Pos)                 /**< (TC_IDR) End of Receiver Transfer Mask */
#define TC_IDR_ENDRX                        TC_IDR_ENDRX_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_ENDRX_Msk instead */
#define TC_IDR_RXBUFF_Pos                   9                                              /**< (TC_IDR) Reception Buffer Full Position */
#define TC_IDR_RXBUFF_Msk                   (_U_(0x1) << TC_IDR_RXBUFF_Pos)                /**< (TC_IDR) Reception Buffer Full Mask */
#define TC_IDR_RXBUFF                       TC_IDR_RXBUFF_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_IDR_RXBUFF_Msk instead */
#define TC_IDR_MASK                         _U_(0x3FF)                                     /**< \deprecated (TC_IDR) Register MASK  (Use TC_IDR_Msk instead)  */
#define TC_IDR_Msk                          _U_(0x3FF)                                     /**< (TC_IDR) Register Mask  */


/* -------- TC_IMR : (TC Offset: 0x2c) (R/ 32) Interrupt Mask Register (channel = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t COVFS:1;                   /**< bit:      0  Counter Overflow                         */
    uint32_t LOVRS:1;                   /**< bit:      1  Load Overrun                             */
    uint32_t CPAS:1;                    /**< bit:      2  RA Compare                               */
    uint32_t CPBS:1;                    /**< bit:      3  RB Compare                               */
    uint32_t CPCS:1;                    /**< bit:      4  RC Compare                               */
    uint32_t LDRAS:1;                   /**< bit:      5  RA Loading                               */
    uint32_t LDRBS:1;                   /**< bit:      6  RB Loading                               */
    uint32_t ETRGS:1;                   /**< bit:      7  External Trigger                         */
    uint32_t ENDRX:1;                   /**< bit:      8  End of Receiver Transfer                 */
    uint32_t RXBUFF:1;                  /**< bit:      9  Reception Buffer Full                    */
    uint32_t :22;                       /**< bit: 10..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TC_IMR_Type;
