ataradov/mcu-starter-projects/samg53/include/component/tc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RPR0_OFFSET                      (0x100)                                       /**<  (TC_RPR0) Receive Pointer Register (pdc = 0)  Offset */

#define TC_RPR0_RXPTR_Pos                   0                                              /**< (TC_RPR0) Receive Pointer Register Position */
#define TC_RPR0_RXPTR_Msk                   (_U_(0xFFFFFFFF) << TC_RPR0_RXPTR_Pos)         /**< (TC_RPR0) Receive Pointer Register Mask */
#define TC_RPR0_RXPTR(value)                (TC_RPR0_RXPTR_Msk & ((value) << TC_RPR0_RXPTR_Pos))
#define TC_RPR0_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (TC_RPR0) Register MASK  (Use TC_RPR0_Msk instead)  */
#define TC_RPR0_Msk                         _U_(0xFFFFFFFF)                                /**< (TC_RPR0) Register Mask  */


/* -------- TC_RNPR0 : (TC Offset: 0x110) (R/W 32) Receive Next Pointer Register (pdc = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TC_RNPR0_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RNPR0_OFFSET                     (0x110)                                       /**<  (TC_RNPR0) Receive Next Pointer Register (pdc = 0)  Offset */

#define TC_RNPR0_RXNPTR_Pos                 0                                              /**< (TC_RNPR0) Receive Next Pointer Position */
#define TC_RNPR0_RXNPTR_Msk                 (_U_(0xFFFFFFFF) << TC_RNPR0_RXNPTR_Pos)       /**< (TC_RNPR0) Receive Next Pointer Mask */
#define TC_RNPR0_RXNPTR(value)              (TC_RNPR0_RXNPTR_Msk & ((value) << TC_RNPR0_RXNPTR_Pos))
#define TC_RNPR0_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (TC_RNPR0) Register MASK  (Use TC_RNPR0_Msk instead)  */
#define TC_RNPR0_Msk                        _U_(0xFFFFFFFF)                                /**< (TC_RNPR0) Register Mask  */


/* -------- TC_RNCR0 : (TC Offset: 0x114) (R/W 32) Receive Next Counter Register (pdc = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TC_RNCR0_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_RNCR0_OFFSET                     (0x114)                                       /**<  (TC_RNCR0) Receive Next Counter Register (pdc = 0)  Offset */

#define TC_RNCR0_RXNCTR_Pos                 0                                              /**< (TC_RNCR0) Receive Next Counter Position */
#define TC_RNCR0_RXNCTR_Msk                 (_U_(0xFFFF) << TC_RNCR0_RXNCTR_Pos)           /**< (TC_RNCR0) Receive Next Counter Mask */
#define TC_RNCR0_RXNCTR(value)              (TC_RNCR0_RXNCTR_Msk & ((value) << TC_RNCR0_RXNCTR_Pos))
#define TC_RNCR0_MASK                       _U_(0xFFFF)                                    /**< \deprecated (TC_RNCR0) Register MASK  (Use TC_RNCR0_Msk instead)  */
#define TC_RNCR0_Msk                        _U_(0xFFFF)                                    /**< (TC_RNCR0) Register Mask  */


/* -------- TC_PTCR0 : (TC Offset: 0x120) (/W 32) Transfer Control Register (pdc = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TC_PTCR0_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_PTCR0_OFFSET                     (0x120)                                       /**<  (TC_PTCR0) Transfer Control Register (pdc = 0)  Offset */

#define TC_PTCR0_RXTEN_Pos                  0                                              /**< (TC_PTCR0) Receiver Transfer Enable Position */
#define TC_PTCR0_RXTEN_Msk                  (_U_(0x1) << TC_PTCR0_RXTEN_Pos)               /**< (TC_PTCR0) Receiver Transfer Enable Mask */
#define TC_PTCR0_RXTEN                      TC_PTCR0_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_RXTEN_Msk instead */
#define TC_PTCR0_RXTDIS_Pos                 1                                              /**< (TC_PTCR0) Receiver Transfer Disable Position */
#define TC_PTCR0_RXTDIS_Msk                 (_U_(0x1) << TC_PTCR0_RXTDIS_Pos)              /**< (TC_PTCR0) Receiver Transfer Disable Mask */
#define TC_PTCR0_RXTDIS                     TC_PTCR0_RXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_RXTDIS_Msk instead */
#define TC_PTCR0_TXTEN_Pos                  8                                              /**< (TC_PTCR0) Transmitter Transfer Enable Position */
#define TC_PTCR0_TXTEN_Msk                  (_U_(0x1) << TC_PTCR0_TXTEN_Pos)               /**< (TC_PTCR0) Transmitter Transfer Enable Mask */
#define TC_PTCR0_TXTEN                      TC_PTCR0_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_TXTEN_Msk instead */
#define TC_PTCR0_TXTDIS_Pos                 9                                              /**< (TC_PTCR0) Transmitter Transfer Disable Position */
#define TC_PTCR0_TXTDIS_Msk                 (_U_(0x1) << TC_PTCR0_TXTDIS_Pos)              /**< (TC_PTCR0) Transmitter Transfer Disable Mask */
#define TC_PTCR0_TXTDIS                     TC_PTCR0_TXTDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_TXTDIS_Msk instead */
#define TC_PTCR0_RXCBEN_Pos                 16                                             /**< (TC_PTCR0) Receiver Circular Buffer Enable Position */
#define TC_PTCR0_RXCBEN_Msk                 (_U_(0x1) << TC_PTCR0_RXCBEN_Pos)              /**< (TC_PTCR0) Receiver Circular Buffer Enable Mask */
#define TC_PTCR0_RXCBEN                     TC_PTCR0_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_RXCBEN_Msk instead */
#define TC_PTCR0_RXCBDIS_Pos                17                                             /**< (TC_PTCR0) Receiver Circular Buffer Disable Position */
#define TC_PTCR0_RXCBDIS_Msk                (_U_(0x1) << TC_PTCR0_RXCBDIS_Pos)             /**< (TC_PTCR0) Receiver Circular Buffer Disable Mask */
#define TC_PTCR0_RXCBDIS                    TC_PTCR0_RXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_RXCBDIS_Msk instead */
#define TC_PTCR0_TXCBEN_Pos                 18                                             /**< (TC_PTCR0) Transmitter Circular Buffer Enable Position */
#define TC_PTCR0_TXCBEN_Msk                 (_U_(0x1) << TC_PTCR0_TXCBEN_Pos)              /**< (TC_PTCR0) Transmitter Circular Buffer Enable Mask */
#define TC_PTCR0_TXCBEN                     TC_PTCR0_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_TXCBEN_Msk instead */
#define TC_PTCR0_TXCBDIS_Pos                19                                             /**< (TC_PTCR0) Transmitter Circular Buffer Disable Position */
#define TC_PTCR0_TXCBDIS_Msk                (_U_(0x1) << TC_PTCR0_TXCBDIS_Pos)             /**< (TC_PTCR0) Transmitter Circular Buffer Disable Mask */
#define TC_PTCR0_TXCBDIS                    TC_PTCR0_TXCBDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_TXCBDIS_Msk instead */
#define TC_PTCR0_ERRCLR_Pos                 24                                             /**< (TC_PTCR0) Transfer Bus Error Clear Position */
#define TC_PTCR0_ERRCLR_Msk                 (_U_(0x1) << TC_PTCR0_ERRCLR_Pos)              /**< (TC_PTCR0) Transfer Bus Error Clear Mask */
#define TC_PTCR0_ERRCLR                     TC_PTCR0_ERRCLR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTCR0_ERRCLR_Msk instead */
#define TC_PTCR0_MASK                       _U_(0x10F0303)                                 /**< \deprecated (TC_PTCR0) Register MASK  (Use TC_PTCR0_Msk instead)  */
#define TC_PTCR0_Msk                        _U_(0x10F0303)                                 /**< (TC_PTCR0) Register Mask  */


