ataradov/mcu-starter-projects/samg53/include/component/tc.h
/* -------- TC_PTSR0 : (TC Offset: 0x124) (R/ 32) Transfer Status Register (pdc = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TC_PTSR0_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TC_PTSR0_OFFSET                     (0x124)                                       /**<  (TC_PTSR0) Transfer Status Register (pdc = 0)  Offset */

#define TC_PTSR0_RXTEN_Pos                  0                                              /**< (TC_PTSR0) Receiver Transfer Enable Position */
#define TC_PTSR0_RXTEN_Msk                  (_U_(0x1) << TC_PTSR0_RXTEN_Pos)               /**< (TC_PTSR0) Receiver Transfer Enable Mask */
#define TC_PTSR0_RXTEN                      TC_PTSR0_RXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTSR0_RXTEN_Msk instead */
#define TC_PTSR0_TXTEN_Pos                  8                                              /**< (TC_PTSR0) Transmitter Transfer Enable Position */
#define TC_PTSR0_TXTEN_Msk                  (_U_(0x1) << TC_PTSR0_TXTEN_Pos)               /**< (TC_PTSR0) Transmitter Transfer Enable Mask */
#define TC_PTSR0_TXTEN                      TC_PTSR0_TXTEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTSR0_TXTEN_Msk instead */
#define TC_PTSR0_RXCBEN_Pos                 16                                             /**< (TC_PTSR0) Receiver Circular Buffer Enable Position */
#define TC_PTSR0_RXCBEN_Msk                 (_U_(0x1) << TC_PTSR0_RXCBEN_Pos)              /**< (TC_PTSR0) Receiver Circular Buffer Enable Mask */
#define TC_PTSR0_RXCBEN                     TC_PTSR0_RXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTSR0_RXCBEN_Msk instead */
#define TC_PTSR0_TXCBEN_Pos                 18                                             /**< (TC_PTSR0) Transmitter Circular Buffer Enable Position */
#define TC_PTSR0_TXCBEN_Msk                 (_U_(0x1) << TC_PTSR0_TXCBEN_Pos)              /**< (TC_PTSR0) Transmitter Circular Buffer Enable Mask */
#define TC_PTSR0_TXCBEN                     TC_PTSR0_TXCBEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTSR0_TXCBEN_Msk instead */
#define TC_PTSR0_ERR_Pos                    24                                             /**< (TC_PTSR0) Transfer Bus Error Position */
#define TC_PTSR0_ERR_Msk                    (_U_(0x1) << TC_PTSR0_ERR_Pos)                 /**< (TC_PTSR0) Transfer Bus Error Mask */
#define TC_PTSR0_ERR                        TC_PTSR0_ERR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use TC_PTSR0_ERR_Msk instead */
#define TC_PTSR0_MASK                       _U_(0x1050101)                                 /**< \deprecated (TC_PTSR0) Register MASK  (Use TC_PTSR0_Msk instead)  */
#define TC_PTSR0_Msk                        _U_(0x1050101)                                 /**< (TC_PTSR0) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief TC_CHANNEL hardware registers */
typedef struct {  
  __O  uint32_t TC_CCR;         /**< (TC_CHANNEL Offset: 0x00) Channel Control Register (channel = 0) */
  __IO uint32_t TC_CMR;         /**< (TC_CHANNEL Offset: 0x04) Channel Mode Register (channel = 0) */
  __IO uint32_t TC_SMMR;        /**< (TC_CHANNEL Offset: 0x08) Stepper Motor Mode Register (channel = 0) */
  __I  uint32_t TC_RAB;         /**< (TC_CHANNEL Offset: 0x0C) Register AB (channel = 0) */
  __I  uint32_t TC_CV;          /**< (TC_CHANNEL Offset: 0x10) Counter Value (channel = 0) */
  __IO uint32_t TC_RA;          /**< (TC_CHANNEL Offset: 0x14) Register A (channel = 0) */
  __IO uint32_t TC_RB;          /**< (TC_CHANNEL Offset: 0x18) Register B (channel = 0) */
  __IO uint32_t TC_RC;          /**< (TC_CHANNEL Offset: 0x1C) Register C (channel = 0) */
  __I  uint32_t TC_SR;          /**< (TC_CHANNEL Offset: 0x20) Status Register (channel = 0) */
  __O  uint32_t TC_IER;         /**< (TC_CHANNEL Offset: 0x24) Interrupt Enable Register (channel = 0) */
  __O  uint32_t TC_IDR;         /**< (TC_CHANNEL Offset: 0x28) Interrupt Disable Register (channel = 0) */
  __I  uint32_t TC_IMR;         /**< (TC_CHANNEL Offset: 0x2C) Interrupt Mask Register (channel = 0) */
       RoReg8                         Reserved1[0x10];
} TcChannel;

#define TCCHANNEL_NUMBER 3
/** \brief TC hardware registers */
typedef struct {  
       TcChannel TC_CHANNEL[TCCHANNEL_NUMBER]; /**< Offset: 0x00 Channel Control Register (channel = 0) */
  __O  uint32_t TC_BCR;         /**< (TC Offset: 0xC0) Block Control Register */
  __IO uint32_t TC_BMR;         /**< (TC Offset: 0xC4) Block Mode Register */
  RoReg8  Reserved1[0x1C];
  __IO uint32_t TC_WPMR;        /**< (TC Offset: 0xE4) Write Protection Mode Register */
  RoReg8  Reserved2[0x18];
  __IO uint32_t TC_RPR0;        /**< (TC Offset: 0x100) Receive Pointer Register (pdc = 0) */
  RoReg8  Reserved3[0xC];
  __IO uint32_t TC_RNPR0;       /**< (TC Offset: 0x110) Receive Next Pointer Register (pdc = 0) */
  __IO uint32_t TC_RNCR0;       /**< (TC Offset: 0x114) Receive Next Counter Register (pdc = 0) */
  RoReg8  Reserved4[0x8];
  __O  uint32_t TC_PTCR0;       /**< (TC Offset: 0x120) Transfer Control Register (pdc = 0) */
  __I  uint32_t TC_PTSR0;       /**< (TC Offset: 0x124) Transfer Status Register (pdc = 0) */
} Tc;

