ataradov/mcu-starter-projects/samg53/include/component/tc.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief TC_CHANNEL hardware registers */
typedef struct {  
  __O  TC_CCR_Type                    TC_CCR;         /**< Offset: 0x00 ( /W  32) Channel Control Register (channel = 0) */
  __IO TC_CMR_Type                    TC_CMR;         /**< Offset: 0x04 (R/W  32) Channel Mode Register (channel = 0) */
  __IO TC_SMMR_Type                   TC_SMMR;        /**< Offset: 0x08 (R/W  32) Stepper Motor Mode Register (channel = 0) */
  __I  TC_RAB_Type                    TC_RAB;         /**< Offset: 0x0C (R/   32) Register AB (channel = 0) */
  __I  TC_CV_Type                     TC_CV;          /**< Offset: 0x10 (R/   32) Counter Value (channel = 0) */
  __IO TC_RA_Type                     TC_RA;          /**< Offset: 0x14 (R/W  32) Register A (channel = 0) */
  __IO TC_RB_Type                     TC_RB;          /**< Offset: 0x18 (R/W  32) Register B (channel = 0) */
  __IO TC_RC_Type                     TC_RC;          /**< Offset: 0x1C (R/W  32) Register C (channel = 0) */
  __I  TC_SR_Type                     TC_SR;          /**< Offset: 0x20 (R/   32) Status Register (channel = 0) */
  __O  TC_IER_Type                    TC_IER;         /**< Offset: 0x24 ( /W  32) Interrupt Enable Register (channel = 0) */
  __O  TC_IDR_Type                    TC_IDR;         /**< Offset: 0x28 ( /W  32) Interrupt Disable Register (channel = 0) */
  __I  TC_IMR_Type                    TC_IMR;         /**< Offset: 0x2C (R/   32) Interrupt Mask Register (channel = 0) */
       RoReg8                         Reserved1[0x10];
} TcChannel;

/** \brief TC hardware registers */
typedef struct {  
       TcChannel                      TC_CHANNEL[3];  /**< Offset: 0x00 Channel Control Register (channel = 0) */
  __O  TC_BCR_Type                    TC_BCR;         /**< Offset: 0xC0 ( /W  32) Block Control Register */
  __IO TC_BMR_Type                    TC_BMR;         /**< Offset: 0xC4 (R/W  32) Block Mode Register */
  __I  uint32_t                       Reserved1[7];
  __IO TC_WPMR_Type                   TC_WPMR;        /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  uint32_t                       Reserved2[6];
  __IO TC_RPR0_Type                   TC_RPR0;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register (pdc = 0) */
  __I  uint32_t                       Reserved3[3];
  __IO TC_RNPR0_Type                  TC_RNPR0;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register (pdc = 0) */
  __IO TC_RNCR0_Type                  TC_RNCR0;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register (pdc = 0) */
  __I  uint32_t                       Reserved4[2];
  __O  TC_PTCR0_Type                  TC_PTCR0;       /**< Offset: 0x120 ( /W  32) Transfer Control Register (pdc = 0) */
  __I  TC_PTSR0_Type                  TC_PTSR0;       /**< Offset: 0x124 (R/   32) Transfer Status Register (pdc = 0) */
} Tc;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Timer Counter */

#endif /* _SAMG53_TC_COMPONENT_H_ */
